In [1]:
import pandas as pd

In [2]:
primary_data = {'student_id':['AB-123-2222','BB-897-7556','BS-555-7677','GG-456-7767'],
               'First Name': ['Alex', 'Hugo','Ben','Charlie'],
               'Last Name': ['White','Mathews','Thomas','Cook']}

In [3]:
primary_data

{'student_id': ['AB-123-2222', 'BB-897-7556', 'BS-555-7677', 'GG-456-7767'],
 'First Name': ['Alex', 'Hugo', 'Ben', 'Charlie'],
 'Last Name': ['White', 'Mathews', 'Thomas', 'Cook']}

In [4]:
student_details = pd.DataFrame(primary_data, columns=['student_id','First Name','Last Name'])

In [5]:
student_details

    student_id First Name Last Name
0  AB-123-2222       Alex     White
1  BB-897-7556       Hugo   Mathews
2  BS-555-7677        Ben    Thomas
3  GG-456-7767    Charlie      Cook

In [6]:
student_details['First Name']

0       Alex
1       Hugo
2        Ben
3    Charlie
Name: First Name, dtype: object

In [7]:
type(student_details['First Name'])

pandas.core.series.Series

In [8]:
type(student_details)

pandas.core.frame.DataFrame

In [9]:
student_details[['First Name']]

  First Name
0       Alex
1       Hugo
2        Ben
3    Charlie

In [10]:
type(student_details[['First Name']])

pandas.core.frame.DataFrame

In [12]:
student_details[0:2]

    student_id First Name Last Name
0  AB-123-2222       Alex     White
1  BB-897-7556       Hugo   Mathews

In [13]:
student_details.iloc[:,1:3]

  First Name Last Name
0       Alex     White
1       Hugo   Mathews
2        Ben    Thomas
3    Charlie      Cook

In [14]:
secondary_data = {'stu_id':['AB-123-2222','BB-897-7556','BS-555-7677','GG-456-5555'],
                 'student_course':['DS','ML','AI','BI'],
                 'Duration':[4,6,6,2]}

In [15]:
secondary_data

{'stu_id': ['AB-123-2222', 'BB-897-7556', 'BS-555-7677', 'GG-456-5555'],
 'student_course': ['DS', 'ML', 'AI', 'BI'],
 'Duration': [4, 6, 6, 2]}

In [16]:
student_credentials = pd.DataFrame(secondary_data,columns=['stu_id','student_course','Duration'])

In [17]:
student_credentials

        stu_id student_course  Duration
0  AB-123-2222             DS         4
1  BB-897-7556             ML         6
2  BS-555-7677             AI         6
3  GG-456-5555             BI         2

In [18]:
pd.concat([student_details, student_credentials], axis=0)

C:\Users\HP\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   Duration First Name Last Name       stu_id student_course   student_id
0       NaN       Alex     White          NaN            NaN  AB-123-2222
1       NaN       Hugo   Mathews          NaN            NaN  BB-897-7556
2       NaN        Ben    Thomas          NaN            NaN  BS-555-7677
3       NaN    Charlie      Cook          NaN            NaN  GG-456-7767
0       4.0        NaN       NaN  AB-123-2222             DS          NaN
1       6.0        NaN       NaN  BB-897-7556             ML          NaN
2       6.0        NaN       NaN  BS-555-7677             AI          NaN
3       2.0        NaN       NaN  GG-456-5555             BI          NaN

In [19]:
pd.concat([student_details,student_credentials],axis=1)

    student_id First Name Last Name       stu_id student_course  Duration
0  AB-123-2222       Alex     White  AB-123-2222             DS         4
1  BB-897-7556       Hugo   Mathews  BB-897-7556             ML         6
2  BS-555-7677        Ben    Thomas  BS-555-7677             AI         6
3  GG-456-7767    Charlie      Cook  GG-456-5555             BI         2

In [20]:
pd.merge(student_details,student_credentials, left_on='student_id', right_on='stu_id', how='inner')

    student_id First Name Last Name       stu_id student_course  Duration
0  AB-123-2222       Alex     White  AB-123-2222             DS         4
1  BB-897-7556       Hugo   Mathews  BB-897-7556             ML         6
2  BS-555-7677        Ben    Thomas  BS-555-7677             AI         6

In [21]:
pd.merge(student_details,student_credentials,left_on='student_id',right_on='stu_id', how='left')

    student_id First Name Last Name       stu_id student_course  Duration
0  AB-123-2222       Alex     White  AB-123-2222             DS       4.0
1  BB-897-7556       Hugo   Mathews  BB-897-7556             ML       6.0
2  BS-555-7677        Ben    Thomas  BS-555-7677             AI       6.0
3  GG-456-7767    Charlie      Cook          NaN            NaN       NaN

In [22]:
pd.merge(student_details,student_credentials,left_on='student_id',right_on='stu_id', how='right')

    student_id First Name Last Name       stu_id student_course  Duration
0  AB-123-2222       Alex     White  AB-123-2222             DS         4
1  BB-897-7556       Hugo   Mathews  BB-897-7556             ML         6
2  BS-555-7677        Ben    Thomas  BS-555-7677             AI         6
3          NaN        NaN       NaN  GG-456-5555             BI         2

In [23]:
pd.merge(student_details,student_credentials,left_on='student_id', right_on='stu_id', how='outer')

    student_id First Name Last Name       stu_id student_course  Duration
0  AB-123-2222       Alex     White  AB-123-2222             DS       4.0
1  BB-897-7556       Hugo   Mathews  BB-897-7556             ML       6.0
2  BS-555-7677        Ben    Thomas  BS-555-7677             AI       6.0
3  GG-456-7767    Charlie      Cook          NaN            NaN       NaN
4          NaN        NaN       NaN  GG-456-5555             BI       2.0

In [24]:
raw_data={'Country':['Russia','Australia','China','India','America'],
         'Area':[17.25,3.09,21.45,7.14,11.63],
         'Vehicles':[324,120,800,1000,756]}

In [25]:
raw_data

{'Country': ['Russia', 'Australia', 'China', 'India', 'America'],
 'Area': [17.25, 3.09, 21.45, 7.14, 11.63],
 'Vehicles': [324, 120, 800, 1000, 756]}

In [26]:
country_data=pd.DataFrame(raw_data,columns=['Country','Area','Vehicles'])

In [27]:
country_data

     Country   Area  Vehicles
0     Russia  17.25       324
1  Australia   3.09       120
2      China  21.45       800
3      India   7.14      1000
4    America  11.63       756

In [28]:
country_data.index=['RU','AU','CH','IN','AM']

In [29]:
country_data

      Country   Area  Vehicles
RU     Russia  17.25       324
AU  Australia   3.09       120
CH      China  21.45       800
IN      India   7.14      1000
AM    America  11.63       756

In [30]:
country_data.loc['AU']

Country     Australia
Area             3.09
Vehicles          120
Name: AU, dtype: object

In [31]:
type(country_data.loc['AU'])

pandas.core.series.Series

In [32]:
country_data.loc[['AU']]

      Country  Area  Vehicles
AU  Australia  3.09       120

In [33]:
type(country_data.loc[['AU']])

pandas.core.frame.DataFrame

In [34]:
country_data.loc[['AU','CH','IN'],['Area','Vehicles']]

     Area  Vehicles
AU   3.09       120
CH  21.45       800
IN   7.14      1000